In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame([["a", 1], ["b", 2]], columns=["alphabet", "decimal"])

  alphabet  decimal
0        a        1
1        b        2

In [7]:
df.dtypes

alphabet    object
decimal      int64
dtype: object

In [43]:
df.alphabet

0    a
1    b
Name: alphabet, dtype: object

In [44]:
df.decimal

0    1
1    2
Name: decimal, dtype: int64

In [8]:
df2 = pd.DataFrame([["a", "c"], ["b", 2]], columns=["alphabet", "decimal"])

In [10]:
df2.dtypes

alphabet    object
decimal     object
dtype: object

In [11]:
df2

  alphabet decimal
0        a       c
1        b       2

In [27]:
dict1 = {"a": [1, 2, 3], "b": [4, 5, 6], "c":[8, 9, 10]}
df1 = pd.DataFrame(dict1, index=["A", "B", "C"])
df1

   a  b   c
A  1  4   8
B  2  5   9
C  3  6  10

In [26]:
print(df1)
print(type(df1))

   a  b   c
A  1  4   8
B  2  5   9
C  3  6  10
<class 'pandas.core.frame.DataFrame'>

In [28]:
print(df1["a"])
print(type(df1["a"]))

A    1
B    2
C    3
Name: a, dtype: int64
<class 'pandas.core.series.Series'>

In [34]:
df1[["a"]]

   a
A  1
B  2
C  3

In [41]:
df1["A":"A"]

   a  b  c
A  1  4  8

In [42]:
df1.a

A    1
B    2
C    3
Name: a, dtype: int64

In [47]:
df1

   a  b   c
A  1  4   8
B  2  5   9
C  3  6  10

In [52]:
df1.loc[["A", "C"], ["a", "c"]]

   a   c
A  1   8
C  3  10

In [55]:
df1.loc[:,"a":"b"]

   a  b
A  1  4
B  2  5
C  3  6

In [56]:
df1.loc[["A", "C"],"a":"b"]

   a  b
A  1  4
C  3  6

In [62]:
df1

   a  b   c
A  1  4   8
B  2  5   9
C  3  6  10

In [76]:
df1.iloc[[0, 2], 0].loc["A"]

1